import Section from "components/Section/Section";
import TitleH1 from "components/TitleH1/TitleH1";
import TitleH2 from "components/TitleH2/TitleH2";
import Text from "components/Text/Text";
import OpenGraphHelmet from 'components/OpenGraphHelmet/OpenGraphHelmet';


export default function PublicOfferPage() {
  return (
    <main>
      <OpenGraphHelmet
        title="100років • Публічна оферта"
        description="Правила обробки, зберігання та захисту даних Клієнтів (надалі-Правила) визначають порядок поводження з даними користувачів сайту https://100rokiv.com.ua/"
        url="https://100rokiv.netlify.app/public-offer"
        image="https://storokiv-server.herokuapp.com/images/above.jpg"
      />
      <Section sectionClass="sectionPublicOffer">
        <TitleH1 text="Публічний договір (оферта)" />
        <Text
          textClass="textPublicOffer"
          text="Цей договір між ФОП Клопотенко Віктор Васильович, надалі «Продавець» і користувачем послугами інтернет-сайту, в подальшому - «Замовник», є договором доручення на замовлення, придбання та доставку товарів та послуг, визначає основні умови замовлення, придбання та доставки товарів та/або послуг через інтернет https://100rokiv.com.ua/ . Замовник, діючи з метою придбання Товару та/або послуги, приймає умови цього договору купівлі-продажу товарів/послуг (далі - Договір) на наступних умовах:"
        />
        <Text textClass="textPublicOffer" text="1. ВИЗНАЧЕННЯ ТЕРМІНІВ" />
        <Text
          textClass="textPublicOffer"
          text="1.1. Публічна оферта (далі - «Оферта») - публічна пропозиція Продавця, адресована невизначеному колу осіб, укласти з Продавцем договір купівлі-продажу товарів та/або послуг дистанційним способом (далі - «Договір») на умовах, що містяться в цій Оферті, включаючи всі Додатки."
        />
        <Text
          textClass="textPublicOffer"
          text="1.2. Замовлення - рішення Замовника замовити товар/послугу і його доставку, оформлене в інтернет-магазині і / або доручення на придбання і доставку товарів."
        />
        <Text textClass="textPublicOffer" text="2. ЗАГАЛЬНІ ПОЛОЖЕННЯ" />
        <Text
          textClass="textPublicOffer"
          text="2.1. Наведена нижче інформація є офіційною пропозицією (офертою) інтернет-магазину https://100rokiv.com.ua/ будь-якій фізичній особі (далі - Замовник) укласти договір купівлі-продажу товарів та/або послуг. Зазначений договір є публічним, тобто відповідно до статті 633 Цивільного кодексу України його умови однакові для всіх замовників."
        />
        <Text
          textClass="textPublicOffer"
          text="2.2. Згідно зі статтею 642 Цивільного Кодексу України повним і беззастережним прийняттям умов даної пропозиції (оферти), що підтверджує укладення Договору купівлі-продажу товарів та/або послуг на запропонованих нижче умовах, є факт оформлення та підтвердження замовлення."
        />
        <Text
          textClass="textPublicOffer"
          text="2.3. Оформленням Замовлення Замовник підтверджує узгодження і безумовне прийняття ним умов цього пропозиції (оферти)."
        />
        <Text
          textClass="textPublicOffer"
          text="2.4. Укладаючи Договір (тобто акцептуючи умови справжнього Пропозиції (Пропоновані можливості) шляхом оформлення Замовлення), Замовник підтверджує наступне: а) Замовник цілком і повністю ознайомлений, і згоден з умовами цієї пропозиції (оферти); б) він дає дозвіл на збір, обробку та передачу персональних даних на умовах, визначених нижче в застереженні щодо збору, обробки та передачі персональних даних, дозвіл на обробку персональних даних діє протягом усього терміну дії Договору, а також протягом необмеженого терміну після закінчення його дії. Крім цього, укладенням Договору Замовник підтверджує, що він повідомлений (без додаткового повідомлення) про права, встановлених Законом України 'Про захист персональних даних', про цілі збору даних, а також про те, що його персональні дані передаються Продавцю з метою можливості виконання умов цього Договору, можливості проведення взаєморозрахунків, а також для отримання рахунків, актів та інших документів. Замовник також погоджується з тим, що Продавець має право надавати доступ та передавати його персональні дані третім особам без будь-яких додаткових повідомлень Замовника, не змінюючи при цьому мету обробки персональних даних. Обсяг прав Замовника, як суб'єкта персональних даних відповідно до Закону України 'Про захист персональних даних' йому відомий і зрозумілий."
        />
        <Text textClass="textPublicOffer" text="3. ЦІНА ТОВАРУ ТА ПОСЛУГИ" />
        <Text
          textClass="textPublicOffer"
          text="3.1. Ціна на кожну позицію Товару та послуги вказана на сайті Інтернет-магазину."
        />
        <Text
          textClass="textPublicOffer"
          text="3.2. Продавець має право в односторонньому порядку змінити ціну на будь-яку позицію Товару/послуги."
        />
        <Text
          textClass="textPublicOffer"
          text="3.3. У разі зміни ціни на замовлений Товар або послугу Продавець зобов'язується проінформувати Замовника про зміну ціни Товару чи послуги."
        />
        <Text
          textClass="textPublicOffer"
          text="3.4. Замовник має право підтвердити або анулювати Замовлення на придбання Товару та/або послуги, якщо ціна змінена Продавцем після оформлення Замовлення."
        />
        <Text
          textClass="textPublicOffer"
          text="3.5. Зміна Продавцем ціни на оплачений Замовником Товар та/або послугу не допускається."
        />
        <Text
          textClass="textPublicOffer"
          text="3.6. Продавець вказує вартість доставки Товару та/або послуги на сайті Інтернет-магазину або повідомляє Замовнику при оформленні замовлення Оператором."
        />
        <Text
          textClass="textPublicOffer"
          text="3.7. Зобов'язання Замовника по оплаті Товару та/або послуги вважаються виконаними з моменту надходження Продавцю коштів."
        />
        <Text
          textClass="textPublicOffer"
          text="3.8. Розрахунки між Продавцем і Замовником за Товар та/або послугу здійснюються способами, зазначеними на сайті Інтернет-магазину в розділі «ДОСТАВКА І ОПЛАТА»."
        />
        <Text textClass="textPublicOffer" text="4. ОФОРМЛЕННЯ ЗАМОВЛЕННЯ" />
        <Text
          textClass="textPublicOffer"
          text="4.1. Замовлення Товару та/або послуги здійснюється Замовником через Оператора по телефону 068-068-69-75 або через сервіс сайту Інтернет-магазину https://100rokiv.com.ua/"
        />
        <Text
          textClass="textPublicOffer"
          text="4.2. При реєстрації на сайті Інтернет-магазину Замовник зобов'язується надати наступну реєстраційну інформацію: 4.2.1. прізвище, ім'я, по батькові Замовника або вказаної ним особи (одержувача); 4.2.3. адреса електронної пошти; 4.2.4. контактний телефон."
        />

        <Text
          textClass="textPublicOffer"
          text="4.3. Найменування, кількість, артикул, ціна обраного Замовником Товару та/або послуги вказуються в кошику Покупця на сайті Інтернет-магазину."
        />
        <Text
          textClass="textPublicOffer"
          text="4.4. Якщо Продавцю необхідна додаткова інформація, він має право запросити її у Замовника. У разі ненадання необхідної інформації Замовником, Продавець не несе відповідальності за надання якісної послуги Замовнику при покупці товарів та/або послуг інтернет-магазину."
        />
        <Text
          textClass="textPublicOffer"
          text="4.5. При оформленні Замовлення через Оператора (п. 4.1. Цієї Оферти) Замовник зобов'язується надати інформацію, зазначену в п. 4.2. цієї Оферти."
        />
        <Text
          textClass="textPublicOffer"
          text="4.6. Ухвалення Замовником умов цієї Оферти здійснюється за допомогою внесення Замовником відповідних даних в реєстраційну форму на сайті Інтернет-магазину або при оформленні Замовлення через Оператора. Після оформлення Замовлення через Оператора дані про Замовника реєструються в базі даних Продавця."
        />
        <Text
          textClass="textPublicOffer"
          text="4.7. Замовник несе відповідальність за достовірність наданої інформації при оформленні Замовлення."
        />
        <Text
          textClass="textPublicOffer"
          text="4.8. Договір купівлі-продажу дистанційним способом між Продавцем і Замовником вважається укладеним з моменту електронного оформлення замовлення на сервісі сайту інтернет-магазину або видачі Продавцем Замовнику касового або товарного чека або іншого документа, що підтверджує оплату Товару та/або послуги."
        />
        <Text
          textClass="textPublicOffer"
          text="5. ДОСТАВКА І ПЕРЕДАЧА ТОВАРУ/ПОСЛУГИ ПОКУПЦЮ"
        />
        <Text
          textClass="textPublicOffer"
          text="5.1. Способи, порядок і терміни доставки товарів та/або послуг вказані на сайті в розділі «ДОСТАВКА І ОПЛАТА». Порядок і умови доставки замовленого товару та/або послуги Замовник погоджує з оператором інтернет-магазину в момент оформлення покупки."
        />
        <Text
          textClass="textPublicOffer"
          text="5.2. Самовивіз товару: 5.2.1. Після формування заявки Замовник може розрахуватися і отримати свій товар та/або послугу з 12.00 до 20.00 щодня. 5.2.2. Право власності та ризик випадкової втрати або пошкодження товару та/або послуги переходить до Замовника або його Представника з моменту отримання товару/послуги шляхом і підписання Сторонами товарного чека і / або замовлення (і / або доручення на придбання і доставку товару) на доставку."
        />
        <Text
          textClass="textPublicOffer"
          text="5.3. Доставка товару та/або послуги здійснюється власними силами співробітниками інтернет - магазину згідно з умовами доставки, або із залученням третіх осіб (перевізника)."
        />
        <Text
          textClass="textPublicOffer"
          text="5.4. При отриманні товару та/або послуги Замовник повинен у присутності представника кур'єра перевірити відповідність Товару/послуги якісним і кількісним характеристикам, (найменування товару, кількість, комплектність, термін придатності)."
        />
        <Text
          textClass="textPublicOffer"
          text="5.5. Замовник або Представник Замовника під час приймання товару/послуги підтверджує своїм підписом в товарному чеку і / або замовленні на доставку товарів/послуг, що не має претензій до кількості товару/послуги, зовнішнім виглядом і комплектності товару/послуги."
        />
        <Text textClass="textPublicOffer" text="6. ПОВЕРНЕННЯ ТОВАРУ" />
        <Text
          textClass="textPublicOffer"
          text="6.1. Замовник має право відмовитися від непідакцизного товару в будь-який час до його передачі, а після передачі непідакцизного товару - в порядку і на умовах, визначених Законом України «Про захист прав споживачів»."
        />
        <Text
          textClass="textPublicOffer"
          text="6.2. Повернення непідакцизного товару належної якості можливий у випадку, якщо збережено його товарний вигляд, споживчі властивості, а також документ, що підтверджує факт покупки і умови замовлення зазначеного товару."
        />
        <Text
          textClass="textPublicOffer"
          text="6.3. Замовник не має права відмовитися від товару/послуги належної якості, що має індивідуально-визначені властивості, якщо зазначений товар/послуга може бути використаний виключно Замовником, який його придбав, (в т.ч. не стандартні, за бажанням Замовника, розміри та інше). Підтвердженням того, що товар/послуга має індивідуально-визначені властивості, є відмінність розмірів товару/послуги та інших характеристик, що вказані в інтернет-магазині."
        />
        <Text
          textClass="textPublicOffer"
          text="6.4. Повернення товару/послуги, у випадках, передбачених законом та цим Договором, здійснюється за адресою, вказаною на сайті в розділі «КОНТАКТИ»."
        />
        <Text
          textClass="textPublicOffer"
          text="6.5. При відмові Замовника від непідакцизного товару належної якості Продавець повертає кошти в розмірі вартості такого Товару, за винятком витрат продавця на доставку товару, який повертається."
        />
        <Text
          textClass="textPublicOffer"
          text="6.6. Повернення суми, зазначеної в п.6.5. здійснюється одночасно з поверненням товару."
        />
        <Text textClass="textPublicOffer" text="7. ВІДПОВІДАЛЬНІСТЬ СТОРІН" />
        <Text
          textClass="textPublicOffer"
          text="7.1. Продавець не несе відповідальності за шкоду, заподіяну Замовнику внаслідок неналежного використання Товарів та/або послуг, попередньо замовлених в межах Сервісу _ https://100rokiv.com.ua/ і придбаних у Продавця."
        />
        <Text
          textClass="textPublicOffer"
          text="7.2. Продавець не несе відповідальності за неналежне, несвоєчасне виконання Замовлень і своїх зобов'язань в разі надання Замовником недостовірної або помилкової інформації."
        />
        <Text
          textClass="textPublicOffer"
          text="7.3. Продавець і Замовник несуть відповідальність за виконання своїх зобов'язань відповідно до чинного законодавства України і положень цього Договору."
        />
        <Text
          textClass="textPublicOffer"
          text="7.4. Продавець або Замовник звільняються від відповідальності за повне або часткове невиконання своїх зобов'язань, якщо невиконання є наслідком форс-мажорних обставин як: війна або військові дії, землетрус, повінь, пожежа та інші стихійні лиха, що виникли незалежно від волі Продавця і / або Замовника після укладення цього договору. Сторона, яка не може виконати свої зобов'язання, негайно повідомляє про це іншу Сторону."
        />
        <TitleH2 titleClass="titlePublicOffer" text="АДРЕСА ТА РЕКВІЗИТИ" />
        <Text
          textClass="textPublicOfferAddress"
          text="ФОП Клопотенко Віктор Васильович"
        />
        <Text
          textClass="textPublicOfferAddress"
          text="01103 м. Київ, вул. Володимирська, будинок 4"
        />
        <Text
          textClass="textPublicOfferAddress"
          text="IBAN 133052990000026001016238415"
        />
        <Text textClass="textPublicOfferAddress" text="РНОКПП 2086906890" />
        <Text textClass="textPublicOfferAddress" text="+380680686975" />

        {/* <p className={s.text}>{text1}</p>
        <p className={s.text}>{text2}</p>
        <p className={s.text}>{text3}</p>
        <p className={s.text}>{text4}</p>
        <p className={s.text}>{text5}</p>
        <p className={s.text}>{text6}</p>
        <p className={s.text}>{text7}</p>
        <p className={s.text}>{text8}</p>
        <h2 className={s.subTitle}>АДРЕСА ТА РЕКВІЗИТИ</h2>
        <p className={s.text}>{companyDetails}</p> */}
      </Section>
    </main>
  );
}
